package Day011;

public class Collection {
    /**
     * Колекции это классы и интерфейсы. интерфейс Collection происходит от его родителя Iterable. От интерфейсва Collection
     * имплементируются другие колецкции как: List Queue Set and Map.
     *
     * List это последовательность обьектов которая
     * может хранить дубликаты и null. Каждый элемент имеет индекс, начинается с 0. В эту колекцию входит:
     * -ArrayList
     * -LinkedList
     * Vector -> Stack
     *
     * Колекция сама по себе это в принципе есть то самое что и группа какаято которую вы имеете. Наприклад у вас есть
     * колекция машин (у которых есть дубликаты) или друзей (у которых нету дубликатов так как они все разные) домов,
     * телефонов и т.д.
     */
}
